Repository: SalaniLeo/Forecast
Catalog: po/*.po
Languages: hi, pt, ru

source: Forecast
hi: फोरकास्ट
pt: Previsão do tempo
ru: Прогноз погоды

source: Weather app for GNOME
pt: Aplicativo de clima para GNOME
ru: Приложение прогноза погоды для GNOME

source: Alternative weather app with custom css styling and more
pt: Aplicativo de clima alternativo com estilo css personalizado e muito mais
ru: Альтернативное приложение прогноза погоды с кастомным стилем CSS и многим другим

source: first screenshot
pt: primeira captura de tela
ru: первый снимок экрана

source: second screenshot
pt: segunda captura de tela
ru: второй снимок экрана

source: third screenshot
pt: terceira captura de tela
ru: третий снимок экрана

source: fourth screenshot
pt: quarta captura de tela
ru: четвёртый снимок экрана

source: fifth screenshot
pt: quinta captura de tela
ru: Пятый снимок экрана

source: Version 0.2.2
pt: Versão 0.2.2
ru: Версия 0.2.2

source: Updates:
pt: Atualizações:
ru: Обновления:

source: Improved design, see below
pt: Design melhorado, veja abaixo
ru: Улучшения дизайна, смотрите ниже

source: Added locations page in preferences
pt: Página de locais adicionada às preferências
ru: Добавлена страница местоположения в настройки

source: Now you can delete locations
pt: Agora você pode deletar locais
ru: Теперь вы можете удалить своё местоположение

source: Added no network status page
pt: Página de status de rede não adicionada
ru: Добавлена страница отсутствия интернета

source: Added reload shortcut
pt: Atalho de recarregamento adicionado
ru: Добавлен ярлык обновления

source: Fixed some bugs
pt: Bugs corrigidos
ru: Исправлены другие баги

source: Design changes:
pt: Mudanças de design:
ru: Изменения дизайна

source: Improved background gradient for all conditions during night
pt: Gradiente de fundo melhorado para todas as condições noturnas
ru: Улучшение фонового градиента для всех ночных погодных условий

source: Modified first time open window
pt: Primeiro acesso modificado
ru: Изменено окно первого запуска

source: Added smooth transitioning between cities
pt: Adicionada transição suave entre cidades
ru: Добавлен плавный переход между городами

source: Added smooth transitioning when reloading
pt: Adicionada transição suave ao recarregar
ru: Добавлен плавный переход при обновлении

source: Added loading page while getting api response
pt: Adicionada página de carregamento durante resposta de api
ru: Добавлена страница загрузки во время получения ответа от API

source: Added probability of rain in 3-hours forecast
pt: Adicionada probabilidade de chuva em 3 horas
ru: Добавлена информация о вероятности дождя в течении трёх часов.

source: Version 0.2.1
pt: Versão 0.2.1
ru: Версия 0.2.1

source: Improved design
pt: Design melhorado
ru: Улучшения дизайна

source: Custom api-key option is now more legible
pt: Opção de chave de api customizada agora é mais legível
ru: Пользовательский ключ API стал более разборчивым

source: Added dark text on light backgrounds
pt: Texto escuro adicionado a fundos mais claros
ru: Добавлен тёмный текст на светлых поверхностях

source: Added option to use glass-like background for all elements
pt: Opção de usar fundos transparentes para todos os elementos
ru: Добавлена опция использования стеклянной подложки для всех элементов

source: Readded local time for selected city
pt: Hora local readicionada para cidade selecionada
ru: Вернулось местное время для выбранного города

source: Version 0.2
pt: Versão 0.2
ru: Версия 0.2

source: Searching for cities is a lot quicker
pt: Busca por cidades se tornou mais rápida
ru: Поиск города стал гораздо быстрее

source: Added roadmap on github
pt: Roadmap adicionado no github
ru: Добавлена дорожная карта развития приложения на GitHub

source: Added one minute time pause for refreshing
pt: Adicionado um minuto de pausa para recarregar
ru: Добавлена минутная пауза перед обновлением информации

source: Added 5 days forecast
pt: Adicionada previsão de 5 dias
ru: Добавлен 5-дневний прогноз погоды

source: Modified current data label
pt: Etiqueta de dados do momento foi modificada
ru: Изменён элемент текущей даты

source: Added glass effect to 3 hours forecast and wind
pt: Adicionado efeito transparente para previsão de 3 horas e ventanias
ru: Добавлен эффект стеклянного размытия для прогноза погоды на 3 часа и ветер.

source: First release
pt: Primeira versão
ru: Первый релиз

source: Stores the api key
pt: Armazena a chave api
ru: Хранилище ключа API

source: stores the api key
pt: armazena a chave api
ru: хранилище ключа API

source: If false uses the default api key
hi: यदि अचयनित है तो तयशुदा API कुंजी का प्रयोग करता है
pt: Se o valor é falso, usa a chave api padrão
ru: Если значение отрицательно, используется ключ API по умолчанию

source: When this is true the app know to use the custom api key
hi: जब यह चयनित होता है तो ऐप तदनुकूल API कुंजी का प्रयोग करता है
pt: Quando isto é verdadeiro, o app sabe como utilizar a chave api customizada
ru: Когда значение положительно, программа знает что нужно использовать пользовательский ключ API

source: Uses a weather based gradient as background
hi: पृष्ठभूमि के रूप में मौसम आधारित ग्रेडिएंट का प्रयोग करता है
pt: Usa um gradiente baseado na previsão como fundo
ru: В качестве фона используется градиент основанный на погоде

source: Use gradient for background
pt: Usa gradiente como fundo
ru: Использовать градиент для фона

source: List of weather places
hi: मौसम स्थानों की सूची
pt: Lista de climas locais
ru: Список мест

source: Stores all user selected location
hi: उपयोक्ता द्वारा चयनित सभी स्थान संग्रहीत करता है
pt: Armazena locais selecionados pelo usuário
ru: Сохраняет все выбранные пользователем местоположения

source: Units
hi: इकाइयां
pt: Unidades
ru: Единицы измерения

source: Chooses what unit of measure to use
pt: Escolhe qual unidade de medida se usa
ru: Выбирает, какую единицу измерения использовать

source: Changes the look of some elements
pt: Muda o visual de alguns elementos
ru: Изменяет внешний вид некоторых элементов

source: Sets whether to show some elements like cards
pt: Configura se elementos serão mostrados como cards
ru: Устанавливает, следует ли отображать некоторые элементы, такие как карточки

source: Changes the color of the text to dark
pt: Muda a cor do texto para escura
ru: Изменяет цвет текста на тёмный

source: Changes the color of the text if the background is too light
pt: Muda a cor do texto se o fundo for muito claro
ru: Изменяет цвет текста если фон слишком светлый

source: Default weather city
hi: तयशुदा मौसम शहर
pt: Cidade padrão
ru: Стандартный город для отображения погоды

source: Changes the default city for the weather
pt: Muda a cidade padrão para previsão de clima
ru: Изменяет стандартный город для отображения погоды

source: Refresh
hi: ताजा करें
pt: Recarregar
ru: Обновить

source: Forecast - loading
pt: Previsão - carregando
ru: Прогноз погода - загружается

source: Preferences
hi: प्राथमिकताएं
pt: Preferências
ru: Настройки

source: About Forecast
hi: फोरकास्ट के बारे में
pt: Sobre Previsão do tempo
ru: О прогнозе погоды

source: No internet connection
pt: Sem conexão de rede
ru: Нет соединения с интернетом

source: Forecast - No Internet Connection
pt: Previsão do tempo - Sem conexão de rede
ru: Прогноз погоды - Нет соединения с интернетом

source: Weather app for Linux
pt: App de clima para o Linux
ru: Приложение погоды для Linux

source: translator-credits
pt: Créditos de tradutor
ru: Фомченков Семён s.fomchenkov@yandex.ru

source: Search a city
pt: Selecione uma cidade
ru: Поиск по городу

source: Welcome to Forecast!
pt: Bem-vindo ao Previsão de tempo
ru: Добро пожаловать в Прогноз погоды

source: Locations
hi: स्थान
pt: Locais
ru: Местоположения

source: App Preferences
pt: Preferências do app
ru: Настройки приложения

source: Appearance Preferences
hi: दिखावट प्राथमिकताएं
pt: Preferências do visual
ru: Настройки оформления

source: Use Gradient as Background
pt: Usar gradiente como fundo
ru: Использовать градиент как фон

source: Applies a gradient based on current weather and time. Requires restart to disable
pt: Aplica efeito gradiente baseado no clima e tempo. Requer reinício para ser desabilitado
ru: Применяет градиент, основанный на текущей погоде и времени. Требуется перезагрузка, чтобы отключить

source: Use glassy background look
pt: Usa fundo semi-transparente
ru: Использовать эффект матового стекла для фона

source: Applies a glass-like background to all elements
pt: Aplica fundo semitransparente a todos os elementos
ru: Применить эффект матового стекла для фона всех элементов

source: Use dark text on dark background
pt: Usa texto escuro em fundo escuro
ru: Использовать тёмный текст на тёмных фонах

source: Chenges the text color from light to dark on light backgrounds
pt: Muda a cor do texto de clara pra escura em fundos claros
ru: Изменить цвет текста с светлого на тёмный при светлом фоне

source: Select which unit of measurement to use
pt: Seleciona qual unidade de medida usar
ru: Выберите, какую единицу измерения использовать

source: API Preferences
hi: API प्राथमिकताएं
pt: Preferências de API
ru: Настройки API

source: Use Personal API Key
hi: निजी API कुंजी का प्रयोग करें
pt: Usar chave de API pessoal
ru: Использовать персональный ключ API

source: Choose whether to use default API key or personal key
hi: प्रयोग हेतु तयशुदा API कुंजी या निजी कुंजी चुनें
pt: Escolha uso de chave API padrão ou chave pessoal
ru: Выберите, использовать ли ключ API по умолчанию или персональный ключ

source: Personal API Key
hi: निजी API कुंजी
pt: Chave de API pessoal
ru: Персональный ключ API

source: Weather
hi: मौसम
pt: Clima
ru: Погода

source: Today
hi: आज
pt: Hoje
ru: Сегодня

source: You must wait at least one minute to refresh
pt: Você precisa esperar pelo menos um minuto pra recarregar
ru: Вы должны подождать минуту перед обновлением данных

source: Local time:
pt: Hora local:
ru: Местное время:

source: Last update:
pt: Última atualização:
ru: Последние обновление:

source: N
ru: Северный

source: NNE
ru: Северный северо-восточный

source: NE
ru: Северо-восточный

source: ENE
ru: Восточный северо-восточный

source: E
ru: Восточный

source: ESE
ru: Восточный юго-восточный

source: SE
ru: Юго-восточный

source: SSE
ru: Южный юго-восточный

source: S
ru: Южный

source: SSW
ru: Южно юго-западный

source: SW
ru: Юго-западный

source: WSW
ru: Западный юго-восточный

source: W
ru: Западный

source: WNW
ru: Западный северо-западный

source: NW
ru: Северо-западный

source: NNW
ru: Север северо-западный

source: Feels like
pt: Sensação de
ru: Ощущается как

source: Wind
hi: हवा
pt: Vento
ru: Ветер

source: Gusts
pt: Radajas
ru: Порывы ветра

source: Pressure
hi: वायुदाब
pt: Pressão
ru: Давление

source: Humidity
hi: आर्द्रता
pt: Umidade
ru: Влажность

source: Visibility
hi: दृश्यता
pt: Visibilidade
ru: Видимость

source: Sunrise
hi: सूर्योदय
pt: Nascer do sol
ru: Восход солнца

source: Sunset
hi: सूर्यास्त
pt: Pôr do sol
ru: Заход солнца

source: The selected city has already been added
pt: A cidade selecionada já foi adicionada
ru: Выбранный город уже добавлен

source: Thunderstorm with Light Rain
hi: हल्की बारिश के साथ आंधी तूफान
pt: Tempestade com chuvas leves
ru: Лёгкий дождь с грозой

source: Thunderstorm with Rain
hi: बारिश के साथ आंधी तूफान
pt: Tempestade com chuvas
ru: Дождь с грозой

source: Thunderstorm with Heavy Rain
hi: भारी बारिश के साथ आंधी तूफान
pt: Tempestade com chuvas pesadas
ru: Сильный дождь с грозой

source: Light Thunderstorm
hi: हल्की आंधी तूफान
pt: Tempestade leve
ru: Лёгкая гроза

source: Thunderstorm
hi: आंधी तूफान
pt: Tempestade
ru: Гроза

source: Heavy Thunderstorm
hi: भारी आंधी तूफान
pt: Tempestade pesada
ru: Сильная гроза

source: Ragged Thunderstorm
hi: प्रचंड आंधी तूफ़ान
pt: Tempestade irregular
ru: Буря

source: Light Drizzle
hi: हल्की बूंदाबांदी
pt: Leve garoa
ru: Лёгкая морось

source: Drizzle
hi: बूंदाबांदी
pt: Garoa
ru: Морось

source: Heavy Drizzle
hi: भारी बूंदाबांदी
pt: Garoa pesada
ru: Сильная морось

source: Light Drizzle Rain
hi: हल्की रिमझिम बारिश
pt: Leve chuvisco
ru: Легко моросящий дождь

source: Drizzle Rain
hi: रिमझिम बारिश
pt: Chuvisco
ru: Моросящий дождь

source: Heavy Drizzle Rain
hi: भारी रिमझिम बारिश
pt: Chuvisco pesado
ru: Сильно моросящий дождь

source: Shower Rain and Drizzle
hi: बौछार बारिश और बूंदाबांदी
pt: Chuva e garoa
ru: Ливень с моросью

source: Heavy Rain and Drizzle
hi: भारी बारिश और बूंदाबांदी
pt: Chuva e garoa pesados
ru: Сильный дождь с моросью

source: Shower Drizzle
hi: बौछार बूंदाबांदी
pt: Garoa leve
ru: Сильная морось

source: Light Rain
hi: हल्की बारिश
pt: Chuva leve
ru: Лёгкий дождь

source: Moderate Rain
hi: मध्यम बारिश
pt: Chuva moderada
ru: Дождь

source: Heavy Rain
hi: भारी बारिश
pt: Chuva pesada
ru: Сильный дождь

source: Very Heavy Rain
hi: बहुत भारी बारिश
pt: Chuva muito pesada
ru: Очень сильный дождь

source: Extreme Rain
hi: अत्यधिक वर्षा
pt: Chuva extrema
ru: Очень-очень сильный дождь

source: Freezing Rain
hi: हिमीकरण बारिश
pt: Chuva congelante
ru: Ледяной дождь

source: Light Shower Rain
hi: हल्की फुहार बारिश
pt: Chuva leve
ru: Лёгкий Ливень

source: Shower Rain
hi: बौछार बारिश
pt: Chuva leve
ru: Ливень

source: Heavy Shower Rain
hi: भारी बौछार बारिश
pt: Pesada chuva
ru: Сильный ливень

source: Ragged Shower Rain
hi: प्रचंड बौछार बारिश
pt: Chuvisco irregular
ru: Ураганный ливень

source: Light Snow
hi: हल्की बर्फ
pt: Pouca neve
ru: Лёгкий снег

source: Snow
hi: बर्फ
pt: Neve
ru: Снег

source: Heavy Snow
hi: भारी बर्फ
pt: Neve pesada
ru: Сильный снег

source: Sleet
hi: ओलावृष्टि
pt: Granizo
ru: Слякоть

source: Light Shower Sleet
hi: हल्की बौछार ओलावृष्टि
pt: Granizo com chuvisco leve
ru: Небольшой дождь с мокрым снегом

source: Shower Sleet
hi: बौछार ओलावृष्टि
pt: Granizo com chuvisco
ru: Дождь с мокрым снегом

source: Light Rain and Snow
hi: हल्की बारिश और हिमपात
pt: Chuva leve e neve
ru: Лёгкий дождь со снегом

source: Rain and Snow
hi: बारिश और हिमपात
pt: Chuva e neve
ru: Дождь и снег

source: Light Shower Snow
hi: हल्की बौछार हिमपात
pt: Chuva de neve leve
ru: Лёгкий снегопад

source: Shower Snow
hi: बौछार हिमपात
pt: Chuva de neve
ru: Снегопад

source: Heavy Shower Snow
hi: भारी बौछार हिमपात
pt: Chuva de neve pesada
ru: Сильный снегопад

source: Mist
hi: कुहासा
pt: Névoa
ru: Дымка

source: Smoke
hi: धुआं
pt: Fumaça
ru: Смог

source: Haze
hi: धुंध
pt: Neblina
ru: Лёгкий туман

source: Sand/Dust Whirls
hi: रेत/धूल के भंवर
pt: Turbilhões de areia/poeira
ru: Песочные/пылевые вихри

source: Fog
hi: कोहरा
pt: Nevoeiro
ru: Туман

source: Sand
hi: रेत
pt: Areia
ru: Песочная буря

source: Dust
hi: धूल
pt: Poeira
ru: Пылевая буря

source: Volcanic Ash
hi: ज्वालामुखी राख
pt: Cinzas vulcânicas
ru: Вулканический пепел

source: Squalls
hi: तूफ़ान
pt: Rajadas
ru: Шквальный ветер

source: Tornado
hi: बवंडर
pt: Tornados
ru: Торнадо

source: Clear Sky
hi: साफ आसमान
pt: Céus limpos
ru: Чистое небо

source: Few Clouds
hi: कुछ बादल
pt: Poucas nuves
ru: Лёгкая облачность

source: Scattered Clouds
hi: छितरे बादल
pt: Nuvens dispersas
ru: Переменная облачность

source: Broken Clouds
hi: टूटे बादल
pt: Nuvens partidas
ru: Облачность

source: Overcast Clouds
hi: छाये हुए बादल
pt: Encoberto de nuvens
ru: Сильная облачность

source: Units preferences
hi: इकाई प्राथमिकताएं

source: Temperature units
hi: तापमान इकाइयां

source: Select which units to use
hi: प्रयोग करने हेतु इकाइयां चुनें

source: Time format
hi: समय प्रारूप

source: Select whether to use the 12h or 24h formats
hi: प्रयोग हेतु 12 घंटे या 24 घंटे का प्रारूप चुनें

source: Use dynamic background
hi: गतिशील पृष्ठभूमि का प्रयोग करें

source: When on, the background changes based on the weather. Restart needed to apply
hi: चालू होने पर, मौसम के आधार पर पृष्ठभूमि बदल जाती है। लागू करने के लिए पुनः प्रारंभ करना आवश्यक है

source: Restart needed to apply changes
hi: परिवर्तन लागू करने के लिए पुनः प्रारंभ करना आवश्यक है

source: Api key not valid
hi: API कुंजी मान्य नहीं है

source: Latitude
hi: अक्षांश

source: Longitude
hi: देशान्तर

source: Use coordinates
hi: निर्देशांक का प्रयोग करें

source: Could not retrieve weather data
hi: मौसम डेटा पुनर्प्राप्त नहीं किया जा सका

source: - Feels like {0}{1}
hi: - {0}{1} जैसा महसूस होता है

source: Alerts
hi: चेतावनी

source: Conditions
hi: स्थिति

source: Feels Like
hi: जैसा महसूस

source: Weekly forecast
hi: साप्ताहिक पूर्वानुमान

source: Pollution
hi: प्रदूषण

source: Details
hi: विवरण

source: Night
hi: रात

source: Evening
hi: शाम

source: Morning
hi: सुबह

source: Afternoon
hi: दोपहर

source: Temperatures
hi: तापमान

source: Temperature
hi: तापमान

source: Wind speed
hi: हवा की गति

source: Cloudiness
hi: बादल

source: Probability of rain
hi: बारिश संभावना

source: UV Index
hi: UV सूचकांक

source: Sun
hi: सूरज

source: Close
hi: बंद करें

source: Metric System
hi: मेट्रिक प्रणाली

source: Imperial System
hi: इम्पीरियल प्रणाली

source: Good
hi: अच्छा

source: Fair
hi: साफ

source: Moderate
hi: मध्यम

source: Poor
hi: खराब

source: Very Poor
hi: बहुत खराब

source: Low
hi: कम

source: Seek shade during midday hours!
hi: दोपहर के समय छाया में रहें!

source: Avoid being outside during midday hours!
hi: दोपहर के समय बाहर रहने से बचें!

source: Invalid UV index input.
hi: अमान्य UV सूचकांक इनपुट।

source: Wait at least 2 minutes between refreshes!
hi: ताजा करने के बीच कम से कम 2 मिनट प्रतीक्षा करें!

source: Main window
hi: मुख्य खिड़की

source: Forecast window
hi: पूर्वानुमान खिड़की

source: Main window with custom background
hi: तदनुकूल पृष्ठभूमि के साथ मुख्य खिड़की

source: Preferences dialog
hi: प्राथमिकताएं संवाद

source: Weather;Forecast;Temperature;
hi: मौसम;पूर्वानुमान;तापमान;

source: Forecast app for GNOME
hi: गनोम के लिए पूर्वानुमान ऐप

source: Stores the users api key
hi: उपयोक्ता API कुंजी संग्रहीत करता है

source: stores the users api key
hi: उपयोक्ता API कुंजी संग्रहीत करता है

source: Chooses wether the user wants a gradient for background
hi: चुनें कि क्या उपयोक्ता पृष्ठभूमि के लिए ग्रेडिएंट चाहता है

source: Chooses between the metric and imperial systems of measurement
hi: माप की मेट्रिक और इम्पीरियल प्रणालियों के बीच चयन करता है

source: use 12h or 24h
hi: 12 घंटे या 24 घंटे का प्रयोग

source: Chooses between the 12h and the 24h time format
hi: 12 घंटे और 24 घंटे के समय प्रारूप के बीच चयन करता है

source: Chooses the default city for the weather
hi: मौसम के लिए तयशुदा शहर चुनता है
